

GEOPRIV                                                    H. Tschofenig
Internet-Draft                                    Nokia Siemens Networks
Intended status: Standards Track                              F. Adrangi
Expires: December 26, 2007                                         Intel
                                                                M. Jones
                                                                 A. Lior
                                                             Bridgewater
                                                           June 24, 2007


            Carrying Location Objects in RADIUS and Diameter
                  draft-ietf-geopriv-radius-lo-13.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on December 26, 2007.

Copyright Notice

   Copyright (C) The IETF Trust (2007).










Tschofenig, et al.      Expires December 26, 2007               [Page 1]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


Abstract

   This document describes procedures for conveying access network
   ownership and location information based on a civic and geospatial
   location format in Remote Authentication Dial In User Service
   (RADIUS) and Diameter.

   The distribution of location information is a privacy sensitive task.
   Dealing with mechanisms to preserve the user's privacy is important
   and addressed in this document.









































Tschofenig, et al.      Expires December 26, 2007               [Page 2]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  5
   3.  Delivery Methods for Location Information  . . . . . . . . . .  6
     3.1.  Location Delivery based on Out-of-Band Agreements  . . . .  6
     3.2.  Location Delivery based on Initial Request . . . . . . . .  7
     3.3.  Location Delivery based on Mid-Session Request . . . . . .  9
     3.4.  Location Delivery in Accounting Messages . . . . . . . . . 10
   4.  Attributes . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     4.1.  Operator-Name Attribute  . . . . . . . . . . . . . . . . . 12
     4.2.  Location-Information Attribute . . . . . . . . . . . . . . 15
     4.3.  Location Data Attribute  . . . . . . . . . . . . . . . . . 17
       4.3.1.  Civic Location Profile . . . . . . . . . . . . . . . . 18
       4.3.2.  Geospatial Location Profile  . . . . . . . . . . . . . 19
     4.4.  Basic Policy Rules Attribute . . . . . . . . . . . . . . . 19
     4.5.  Extended Policy Rules Attribute  . . . . . . . . . . . . . 21
     4.6.  Location-Capable Attribute . . . . . . . . . . . . . . . . 23
     4.7.  Requested-Info Attribute . . . . . . . . . . . . . . . . . 23
   5.  Table of Attributes  . . . . . . . . . . . . . . . . . . . . . 30
   6.  Diameter RADIUS Interoperability . . . . . . . . . . . . . . . 31
   7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 32
     7.1.  Communication Security . . . . . . . . . . . . . . . . . . 32
     7.2.  Privacy Considerations . . . . . . . . . . . . . . . . . . 33
       7.2.1.  RADIUS Client  . . . . . . . . . . . . . . . . . . . . 34
       7.2.2.  RADIUS Server  . . . . . . . . . . . . . . . . . . . . 34
       7.2.3.  RADIUS Proxy . . . . . . . . . . . . . . . . . . . . . 35
     7.3.  Identity Information and Location Information  . . . . . . 35
   8.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 37
     8.1.  New Registry: Operator Namespace Identifier  . . . . . . . 37
     8.2.  New Registry: Location Profiles  . . . . . . . . . . . . . 38
     8.3.  New Registry: Location Capable Attribute . . . . . . . . . 39
     8.4.  New Registry: Entity Types . . . . . . . . . . . . . . . . 39
     8.5.  New Registry: Privacy Flags  . . . . . . . . . . . . . . . 40
     8.6.  New Registry: Requested-Info Attribute . . . . . . . . . . 40
   9.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 42
   10. References . . . . . . . . . . . . . . . . . . . . . . . . . . 44
     10.1. Normative References . . . . . . . . . . . . . . . . . . . 44
     10.2. Informative References . . . . . . . . . . . . . . . . . . 44
   Appendix A.  Matching with Geopriv Requirements  . . . . . . . . . 47
     A.1.  Distribution of Location Information at the User's
           Home Network . . . . . . . . . . . . . . . . . . . . . . . 47
     A.2.  Distribution of Location Information at the Visited
           Network  . . . . . . . . . . . . . . . . . . . . . . . . . 48
     A.3.  Requirements matching  . . . . . . . . . . . . . . . . . . 49
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 55
   Intellectual Property and Copyright Statements . . . . . . . . . . 56




Tschofenig, et al.      Expires December 26, 2007               [Page 3]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


1.  Introduction

   Wireless networks (including wireless LAN) are being deployed in
   public places such as airports, hotels, shopping malls, and coffee
   shops by a diverse set of operators such as cellular network
   operators, Wireless Internet Service Providers (WISPs), and fixed
   broadband operators.  The proposed attributes are also applicable to
   other situations (such as wired networks) where operator network
   ownership and location information has to be conveyed to the RADIUS
   server.

   In the case when the home network needs to know the location of the
   user then, when a user executes the network access authentication
   procedure, information about the location and ownership of the
   visited network needs to be conveyed to the user's home network.  The
   main intent of this document is to enable location aware billing
   (e.g., by determining the appropriate tariff and taxation in
   dependence of the location of the access network and the end host),
   location aware subscriber authentication and authorization for
   roaming environments and to enable other location aware services.

   This document describes attributes to convey location-related
   information both within authentication and accounting exchanges.
   These attributes are usable both within RADIUS and Diameter.

   Location information needs to be protected against unauthorized
   access and distribution to preserve the user's privacy. [9] defines
   requirements for a protocol-independent model for the access to
   geographic location information.  The model includes a Location
   Generator (LG) that creates location information, a Location Server
   (LS) that authorizes access to location information, a Location
   Recipient (LR) that requests and receives information, and a Rule
   Maker (RM) that provides authorization policies to the LS which
   enforces access control policies on requests to location information.
   In Appendix A the requirements for a GEOPRIV Using Protocol are
   compared to the functionality provided by this document.















Tschofenig, et al.      Expires December 26, 2007               [Page 4]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [1].

   RADIUS specific terminology is borrowed from [2] and [10].

   Terminology related to privacy issues, location information and
   authorization policy rules is taken from [9].









































Tschofenig, et al.      Expires December 26, 2007               [Page 5]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


3.  Delivery Methods for Location Information

   The following exchanges show how location information is conveyed in
   RADIUS.  Note that the description of the individual scenarios
   assumes that privacy policies allow location conveyed in RADIUS;
   however the exchanges are also applicableto Diameter, as noted in
   Section 6.  A discussion about the privacy treatment is provided in
   Section 7.2.

3.1.  Location Delivery based on Out-of-Band Agreements

   Figure 1 shows an example message flow for delivering location
   information during the network access authentication and
   authorization procedure.  Upon a network authentication request from
   an access network client, the Network Access Server (NAS) submits a
   RADIUS Access-Request message that contains location information
   attributes among other required attributes.  In this scenario
   location information is attached to the Access-Request message
   without an explicit request from the RADIUS server.  Note that such
   an approach with a prior agreement between the RADIUS client and the
   RADIUS server is only applicable in certain environments.  For
   example, in deployment environments where the RADIUS client and the
   RADIUS server belong to the same organizational entity.  The Basic-
   Policy-Rules attribute is populated based on the defaults described
   in Section 4.4, unless it has been explicitly configured otherwise.


























Tschofenig, et al.      Expires December 26, 2007               [Page 6]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


    +---------+             +---------+                   +---------+
    |         |             | Network |                   |  RADIUS |
    | User    |             | Access  |                   |  Server |
    |         |             | Server  |                   |         |
    +---------+             +---------+                   +---------+
        |                       |                              |
        | Authentication phase  |                              |
        | begin                 |                              |
        |---------------------->|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Request               |
        |                       | + Location-Information       |
        |                       | + Location-Data              |
        |                       | + Basic-Policy-Rules         |
        |                       | + Operator-Name              |
        |                       |----------------------------->|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Accept                |
        |                       |<-----------------------------|
        | Authentication        |                              |
        | Success               |                              |
        |<----------------------|                              |
        |                       |                              |

        Figure 1: Location Delivery based on out-of-band Agreements

3.2.  Location Delivery based on Initial Request

   If no location information is provided by the RADIUS client although
   it is needed by the RADIUS server to compute the authorization
   decision then the RADIUS server challenges the RADIUS client.  This
   exchange is shown in Figure 2.  In the initial Access-Request message
   from the NAS to the RADIUS server the Location-Capable attribute is
   attached to indicate that the NAS understands the Access-Challenge
   message.  The subsequent Access-Challenge message sent from the
   RADIUS server to the NAS provides a hint regarding the type of
   desired location information attributes.  The NAS treates the Basic-
   Policy-Rules and Extended-Policy-Rules attributes as opaque data
   (e.g., it echoes these rules provided by the server within the
   Access-Challenge back in the Access-Request).  In the shown message
   flow the location attributes are then provided in the subsequent
   Access-Request message.  When receiving this Access-Request message
   the authorization procedure at the RADIUS server might be based on a
   number of criteria, including the newly defined attributes listed in
   Section 4.




Tschofenig, et al.      Expires December 26, 2007               [Page 7]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


    +---------+             +---------+                   +---------+
    |         |             | Network |                   |  RADIUS |
    | User    |             | Access  |                   |  Server |
    |         |             | Server  |                   |         |
    +---------+             +---------+                   +---------+
        |                       |                              |
        | Authentication phase  |                              |
        | begin                 |                              |
        |---------------------->|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Request               |
        |                       | + Location-Capable           |
        |                       |----------------------------->|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Challenge             |
        |                       |  + Basic-Policy-Rules        |
        |                       |  + Extended-Policy-Rules     |
        |                       |  + Requested-Info            |
        |                       |<-----------------------------|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Request               |
        |                       |  + Location-Information      |
        |                       |  + Location-Data             |
        |                       |  + Basic-Policy-Rules        |
        |                       |  + Extended-Policy-Rules     |
        |                       |----------------------------->|
        |                       |                              |
        :                       :                              :
        :       Multiple Protocol Exchanges to perform         :
        :    Authentication, Key Exchange and Authorization    :
        :                  ...continued...                     :
        :                       :                              :
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Accept                |
        |                       |<-----------------------------|
        | Authentication        |                              |
        | Success               |                              |
        |<----------------------|                              |
        |                       |                              |

           Figure 2: Location Delivery based on Initial Request






Tschofenig, et al.      Expires December 26, 2007               [Page 8]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


3.3.  Location Delivery based on Mid-Session Request

   The demand mid-session location delivery method utilizes the Change
   of Authorization (COA) message, as defined in [11].  At anytime
   during the session the Dynamic Authorization Client MAY send a COA
   message containing session identification attributes to the RADIUS
   client (i.e., Dynamic Authorization Server).  The COA message may
   instruct the RADIUS client to generate an Authorize-Only Access-
   Request (Access-Request with Service-Type set to "Authorize-Only") in
   which case the RADIUS client MUST include location information in
   this Access-Request if this functionality was previously set in the
   Requested-Info attribute, which also implies the echoing of the
   Basic-Policy-Rules and Extended-Policy-Rules attributes received in
   the previous Access-Accept within the Access-Request sent in response
   to the CoA-Request.

   Figure 3 shows the approach graphically.


    +---------------+                           +---------------+
    | Dynamic       |                           | Dynamic       |
    | Authorization |                           | Authorization |
    | Server        |                           | Client        |
    +---------------+                           +---------------+
        |                                               |
        |  COA  + Service-Type "Authorize Only"         |
        |<----------------------------------------------|
        |                                               |
        |  COA NAK + Service-Type "Authorize Only"      |
        |          + Error-Cause  "Request Initiated"   |
        |---------------------------------------------->|
        |                                               |
        | Access-Request + Service-Type "Authorize Only"|
        |             + Location-Information            |
        |             + Location-Data                   |
        |             + Basic-Policy-Rules              |
        |             + Extended-Policy-Rules           |
        |---------------------------------------------->|
        |                                               |
        | Access-Accept                                 |
        |<----------------------------------------------|
        |                                               |

         Figure 3: Location Delivery based on Mid-Session Request

   Upon receiving the Access-Request message containing the Service-Type
   hint attribute with a value of Authorize-Only from the NAS, the
   RADIUS server responds with either an Access-Accept or an Access-



Tschofenig, et al.      Expires December 26, 2007               [Page 9]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Reject message.

   RFC 3576 [3] is needed when location information is requested on
   demand and location information cannot be obtained from accounting
   messages at all or not in a timely fashion.

3.4.  Location Delivery in Accounting Messages

   Location Information may also be reported in accounting messages.
   Accounting messages are generated when the session starts, when the
   session stops and periodically during the lifetime of the session.
   Accounting messages may also be generated when the user roams during
   handoff.

   Accounting information may be needed by the billing system to
   calculate the user's bill.  For example, there may be different
   tariffs or tax rates applied based on the location.

   If the RADIUS server needs to obtain location information in
   accounting messages then it needs to include a Requested-Info
   attribute to the Access-Accept message.  The Basic-Policy-Rules and
   the Extended-Policy-Rules attributes are to be echoed in the
   Accounting-Request if indicated in the Access-Accept.

   Figure 4 shows the message exchange.


























Tschofenig, et al.      Expires December 26, 2007              [Page 10]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


    +---------+             +---------+                   +---------+
    |         |             | Network |                   | RADIUS  |
    | User    |             | Access  |                   | Server  |
    |         |             | Server  |                   |         |
    +---------+             +---------+                   +---------+
        |                       |                              |
        :                       :                              :
        :          Initial Protocol Interaction                :
        :          (details omitted)                           :
        :                       :                              :
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Accept                |
        |                       |  + Requested-Info            |
        |                       |  + Basic-Policy-Rules        |
        |                       |  + Extended-Policy-Rules     |
        |                       |<-----------------------------|
        | Authentication        |                              |
        | Success               |                              |
        |<----------------------|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Accounting-Request           |
        |                       |  + Location-Information      |
        |                       |  + Location-Data             |
        |                       |  + Basic-Policy-Rules        |
        |                       |  + Extended-Policy-Rules     |
        |                       |----------------------------->|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Accounting-Response          |
        |                       |<-----------------------------|
        |                       |                              |

            Figure 4: Location Delivery in Accounting Messages
















Tschofenig, et al.      Expires December 26, 2007              [Page 11]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


4.  Attributes

4.1.  Operator-Name Attribute

   This attribute carries the operator namespace identifier and the
   operator name.  The operator name is combined with the namespace
   identifier to uniquely identify the owner of an access network.  The
   value of the Operator-Name is a non-NULL terminated string whose
   length MUST NOT exceed 253 bytes.

   The Operator-Name attribute SHOULD be sent in Access-Request, and
   Accounting-Request messages where the Acc-Status-Type is set to
   Start, Interim, or Stop.

   A summary of the Operator-Name attribute is shown below.




































Tschofenig, et al.      Expires December 26, 2007              [Page 12]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |    Length     |            Text              ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       Text (cont.)                                           ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type:

       To Be Assigned by IANA  - Operator-Name

     Length:

       >= 5

     Text:

       This field is at least two octets in length, and the format
       is shown below. The data type of this field is text.
       All fields are transmitted from left to right:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Namespace ID  | Operator-Name                                ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Operator-Name                                                ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Namespace ID:

       The value within this field contains the
       operator namespace identifier. The Namespace ID value
       is encoded as an 8-bit unsigned integer value.

       Example: 1 for REALM

     Operator-Name:

       The text field of variable length contains an
       Access Network Operator Name.
       This field is a RADIUS base data type of Text.

       Example: anyisp.example.com

   The Namespace ID field provides information about the operator
   namespace.  This document defines four values for this attribute that



Tschofenig, et al.      Expires December 26, 2007              [Page 13]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   are listed below.  Additional namespace identifiers must be
   registered with IANA (see Section 8.1) and must be associated with an
   organization responsible for managing the namespace.

   TADIG (0):

      This namespace can be used to indicate operator names based on
      Transferred Account Data Interchange Group (TADIG) codes defined
      in [12].  TADIG codes are assigned by the TADIG Working Group
      within the GSM Association.  The TADIG Code consists of two
      fields, with a total length of five ASCII characters consisting of
      a three-character country code and a two-character alphanumeric
      operator (or company) ID.


   REALM (1):

      The REALM operator namespace can be used to indicate operator
      names based on any registered domain name.  Such names are
      required to be unique and the rights to use a given realm name are
      obtained coincident with acquiring the rights to use a particular
      Fully Qualified Domain Name (FQDN).


   E212 (2):

      The E212 namespace can be used to indicate operator names based on
      the Mobile Country Code (MCC) and Mobile Network Code (MNC)
      defined in [13].  The MCC/MCC values are assigned by the
      Telecommunications Standardization Bureau (TSB) within the ITU-T
      and designated administrators in different countries.  The E212
      value consists of three ASCII digits containing the MCC, followed
      by two or three ASCII digits containing the MNC.


   ICC (3):

      The ICC namespace can be used to indicate operator names based on
      International Telecommunication Union (ITU) Carrier Codes (ICC)
      defined in [14].  ICC values are assigned by national regulatory
      authorities and are coordinated by the Telecommunication
      Standardization Bureau (TSB) within the ITU Telecommunication
      Standardization Sector (ITU-T).  When using the ICC namespace, the
      attribute consists of three uppercase ASCII characters containing
      a three-letter alphabetic country code as defined in [15],
      followed by one to six uppercase alphanumeric ASCII characters
      containing the ICC itself.




Tschofenig, et al.      Expires December 26, 2007              [Page 14]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


4.2.  Location-Information Attribute

   The Location-Information attribute MAY be sent in Access-Request and
   in Accounting-Request messages.  For the Accounting-Request message
   the Acc-Status-Type may be set to Start, Interim or Stop.

   The Location-Information attribute provides meta-data about the
   location information, such as sighting time, time-to-live, location
   determination method, etc.  Implementations SHOULD treat this
   attribute as undistinguished octets, like the Location-Data attribute
   to which it refers.

   The format is shown below.


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |     Type      |    Length     |            String            ...
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |       String (cont.)                                         ...
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

    Type:

      To Be Assigned by IANA  - Location-Information

    Length:

      >= 21

    String:

      This field is at least two octets in length, and the format
      is shown below. The data type of this field is string.
      The fields are transmitted from left to right:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |   Index                       | Code          |  Entity       |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Sighting Time                                                 ~
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Sighting Time                                                 |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Time-to-Live                                                 ...
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



Tschofenig, et al.      Expires December 26, 2007              [Page 15]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


    | Time-to-Live                                                  |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |   Method                                                     ...
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

    Index (16 bits):

      The 16-bit unsigned integer value allows this attribute
      to provide information relating to the information included
      in the Location-Data attribute to which it refers (via the Index).

    Code: (8 bits):

      Describes the location profile that is carried in this attribute
      as an unsigned 8-bit integer value.

    Entity (8 bits):

      This field encodes which location this attribute refers to as an
      unsigned 8-bit integer value.

    Sighting Time (64 bits):

      NTP timestamp for the 'sighting time' field.

    Time-to-Live (64 bits):

      NTP timestamp for the 'time-to-live' field.

    Method (variable):

      Describes the way that the location information was
      determined. The values are registered with the 'method' Tokens
      registry by RFC 4119. The data type of this
      field is a string.

   The following fields need more explanation:

   sighting time:

      This field indicates when the Location Information was accurate.
      The data type of this field is a string and and the content is
      expressed in the 64 bit Network Time Protocol (NTP) timestamp
      format [16].







Tschofenig, et al.      Expires December 26, 2007              [Page 16]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   time-to-live:

      This field gives a hint until when location information should be
      considered current.  The data type of this field is a string and
      the content is expressed in the 64 bit Network Time Protocol (NTP)
      timestamp format [16].  Note that the time-to-live field is
      different than Retention Expires field used in the Basic Policy
      Rules attribute, see Section 4.4.  Retention expires indicates the
      time the recipient is no longer permitted to possess the location
      information.


   Entity:

      Location information can refer to different entities.  This
      document registers two entity values, namely:

         Value (0) describes the location of the user's client device

         Value (1) describes the location of the RADIUS client

      The registry used for these values is established by this
      document, see Section 8.4.


   Code:

      This field indicates the content of the location profile carried
      in the Location-Data attribute.  Two profiles are defined in this
      document, namely one civic location profile (see Section 4.3.1)
      that uses value (0) and a geospatial location profile (see
      Section 4.3.2) that uses the value (1).

   The length of the Location-Information Attribute MUST NOT exceed 253
   octets.

4.3.  Location Data Attribute

   The Location-Data attribute MAY be sent in Access-Request and in
   Accounting-Request messages.  For the Accounting-Request message the
   Acc-Status-Type may be set to Start, Interim or Stop.

   Implementations SHOULD treat this attribute as undistinguished
   octets.

   The format is shown below.





Tschofenig, et al.      Expires December 26, 2007              [Page 17]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |    Length     |            String            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       String (cont.)                                         ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type:

       To Be Assigned by IANA  - Location-Data

     Length:

       >= 21

     String:

       Thhis field is at least two octets in length, and the format
       is shown below. The data type of this field is string.
       All fields are transmitted from left to right:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Index                       |  Location                    ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |  Location                                                    ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Index (16 bits):

       The 16-bit unsigned integer value allows to associate
       the Location-Data attribute with the
       Location-Information attributes.

     Location (variable):

       The format of the location data depends on the location
       profile. This document defines two location profiles.
       Details of the location profiles is described below.

4.3.1.  Civic Location Profile

   Civic location is a popular way to describe the location of an
   entity.  This section defines the civic location information profile
   corresponding to the value (0) indicated in the Code field of the
   Location-Information attribute.  The location format is based on the



Tschofenig, et al.      Expires December 26, 2007              [Page 18]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   encoding format defined in Section 3.1 of [4] whereby the first 3
   octets (i.e., the code for this DHCP option, the length of the DHCP
   option, and the 'what' element are not included) are not put into the
   Location field of the above-described RADIUS Location-Data attribute.

4.3.2.  Geospatial Location Profile

   This section defines the geospatial location information profile
   corresponding to the value (1) indicated in the Code field of the
   Location-Information attribute.  Geospatial location information is
   encoded as an opaque object whereby the format is reused from the
   Section 2 of RFC 3825 Location Configuration Information (LCI) format
   [5]. starting with starting with the third octet (i.e., the code for
   the DHCP option and the length field is not included).

4.4.  Basic Policy Rules Attribute

   The Basic-Policy-Rules attribute MAY be sent in an an Access-Request,
   Access-Accept, an Access-Challenge, an Access-Reject and an
   Accounting-Request message.

   Policy rules control the distribution of location information.  The
   obligation with respect to understanding and processing of the Basic
   Policy Rules attribute for RADIUS clients is to utilize a default
   value of Basic-Policy-Rules unless explicitly configured otherwise,
   and also for clients to echo the Basic-Policy-Rules attribute that
   they receive from a server.  As a default, the note-well field does
   not carry a pointer to human readable privacy policies, the
   retransmission-allowed is set to zero (0), i.e., further distribution
   is not allowed, and the retention-expiresf field is set to 24 hours.

   With regard to authorization policies this document reuses work done
   in [17] and encodes them in a non-XML format.  Two fields ('sighting
   time' and 'time-to-live') are additionally included in the Location-
   Information attribute to conform to the GEOPRIV requirements [9],
   Section 2.7.

   The format of the Basic-Policy-Rules attribute is shown below.


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |    Length     |            String            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       String (cont.)                                         ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Tschofenig, et al.      Expires December 26, 2007              [Page 19]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


     Type:

       To Be Assigned by IANA  - Basic-Policy-Rules

     Length:

       >= 12

     String:

       This field is at least 8 octets in length, and the format
       is shown below. The data type of this field is string.
       All fields are transmitted from left to right:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |  Flags                        | Retention Expires            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Retention Expires                                            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Retention Expires             | Note Well                    ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Note Well                                                    ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Flag (16 bits):

       Only the first bit (R) is defined and corresponds to the
       retransmission-allowed field. All other bits are reserved
       and MUST be zero.

        0                   1
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |R|o o o o o o o o o o o o o o o|
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

       The symbol 'o' refers to reserved flags.

     Retention Expires (64 bits):

       NTP timestamp for the 'retention-expires' field.

     Note Well (variable):

       This field contains a URI that points to human readable
       privacy instructions. The data type of this field is string.



Tschofenig, et al.      Expires December 26, 2007              [Page 20]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   This document reuses fields of the RFC 4119 [17] 'usage-rules'
   element.  These fields have the following meaning:

   retransmission-allowed:

      When the value of this field is to zero (0), then the recipient of
      this Location Object is not permitted to share the enclosed
      location information, or the object as a whole, with other
      parties.  The value of '1' allows to share the location
      information with other parties by considering the extended policy
      rules.


   retention-expires:

      This field specifies an absolute date at which time the Recipient
      is no longer permitted to possess the location information.  The
      data type of this field is a string and the format is a 64 bit NTP
      timestamp [16].


   note-well:

      This field contains a URI that points to human readable privacy
      instructions.  This field is useful when location information is
      distributed to third party entities, which can include humans in a
      location based service.  RADIUS entities are not supposed to
      process this field.

      Whenever a Location Object leaves the RADIUS eco-system the URI in
      the note-well attribute MUST be expanded to the human readable
      text.  For example, when the Location Object is transferred to a
      SIP based environment then the human readable text is placed into
      the 'note-well' element of the 'usage-rules' element contained in
      the PIDF-LO document (see [17]).

4.5.  Extended Policy Rules Attribute

   The Extended-Policy-Rules attribute MAY be sent in an Access-Request,
   an Access-Accept, an Access-Challenge, an Access-Reject and in an
   Accounting-Request message whenever location information is
   transmitted.

   The ruleset reference field of this attribute is of variable length.
   It contains a URI that indicates where the richer ruleset can be
   found.  This URI SHOULD use the HTTPS URI scheme.  As a deviation
   from [17] this field only contains a reference and does not carry an
   attached extended rule set.  This modification is motivated by the



Tschofenig, et al.      Expires December 26, 2007              [Page 21]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   size limitations imposed by RADIUS.

   Policy rules control the distribution of location information and, as
   with the Basic Policy Rules attribute the obligation with respect to
   understanding and processing of the Extended Policy Rules attribute
   for RADIUS clients is when they are explicitly configured to attach
   the URI, and also for clients to echo the Extended-Policy-Rules
   attribute that they receive from a server.  There is no expectation
   that RADIUS clients will need to retrieve data at the URL specified
   in the attribute and to parse the XML policies.

   The format of the Extended-Policy-Rules attribute is shown below.


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |    Length     |            String            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       String (cont.)                                         ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type:

       To Be Assigned by IANA  - Extended-Policy-Rules

     Length:

       >= 4

     String:

       This field is at least two octets in length, and the format
       is shown below. The data type of this field is string.
       The fields are transmitted from left to right:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |    Ruleset Reference                                         ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Ruleset Reference:

       This field contains a URI that points to the policy rules.






Tschofenig, et al.      Expires December 26, 2007              [Page 22]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


4.6.  Location-Capable Attribute

   The Location-Capable attribute allows a NAS (or client function of a
   proxy server) to indicate support for the functionality specified in
   this document.  The Location-Capable attribute with the value for
   'Location Capable' MUST be sent with the Access-Request messages, if
   the NAS supports the functionality described in this document and is
   capable of sending location information.  A RADIUS server SHOULD NOT
   challenge for location information unless the Location-Capable
   attribute has been sent to it.


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Type          | Length        | Integer                       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       Integer (cont.)         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type:

       To Be Assigned by IANA - Location-Capable Attribute

     Length:

       6

     Integer:

       This field is a 32-bit integer value.
       Only a single value is defined for this field:

       Value     | Semantic
       ----------+-----------------
         1       | Location Capable

       Other bit positions are available via IANA
       registration.

4.7.  Requested-Info Attribute

   The Requested-Info attribute allows the RADIUS server to indicate
   what location information about which entity it wants to receive.
   The latter aspect refers to the entities that are indicated in the
   Entity field of the Location-Information attribute.

   If the RADIUS server wants to dynamically decide on a per-request



Tschofenig, et al.      Expires December 26, 2007              [Page 23]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   basis to ask for location information from the RADIUS client then the
   following cases need to be differentiated.  If the RADIUS client and
   the RADIUS server have agreed out-of-band to mandate the transfer of
   location information for every network access authentication request
   then the processing listed below is not applicable.

   o  If the RADIUS server requires location information for computing
      the authorization decision and the RADIUS client does not provide
      it with the Access-Request message then the Requested-Info
      attribute is attached to the Access-Challenge with a hint about
      what is required.  Two cases can be differentiated:

      1.  If the RADIUS client sends the requested information then the
          RADIUS server can process the location-based attributes.

      2.  If the RADIUS server does not receive the requested
          information in response to the Access-Challenge (including the
          Requested-Info attribute) then the RADIUS server may respond
          with an Access-Reject message with an Error-Cause attribute
          (including the "Location-Info-Required" value).

   o  If the RADIUS server would like location information in the
      Accounting-Request message but does not require it for computing
      an authorization decision then the Access-Accept message MUST
      include a Required-Info attribute.  This is typically the case
      when location information is used only for billing.  The RADIUS
      client SHOULD attach location information, if available, to the
      Accounting-Request (unless authorization policies dictate
      something different).

   If the RADIUS server does not send a Requested-Info attribute then
   the RADIUS client MUST NOT attach location information to messages
   towards the RADIUS server, unless an out-of-band agreement is in
   place.  The user's authorization policies, if available, MUST be
   consulted by the RADIUS server before requesting location information
   delivery from the RADIUS client.

   Figure 11 shows a simple protocol exchange where the RADIUS server
   indicates the desire to obtain location information, namely civic
   location information of the user, to grant access.  Since the
   Requested-Info attribute is attached to the Access-Challenge the
   RADIUS server indicates that location information is required for
   computing an authorization decision.








Tschofenig, et al.      Expires December 26, 2007              [Page 24]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


    +---------+                    +---------+
    | RADIUS  |                    | RADIUS  |
    | Client  |                    | Server  |
    +---------+                    +---------+
         |                              |
         |                              |
         | RADIUS                       |
         | Access-Request               |
         | + Location-Capable           |
         |----------------------------->|
         |                              |
         | RADIUS                       |
         | Access-Challenge             |
         | + Requested-Info             |
         |   ('CIVIC_LOCATION',         |
         |    'USERS_LOCATION')         |
         | + Basic-Policy-Rules         |
         | + Extended-Policy-Rules      |
         |<-----------------------------|
         |                              |
         | RADIUS                       |
         | Access-Request               |
         | + Location-Information       |
         | + Location-Data              |
         | + Basic-Policy-Rules         |
         | + Extended-Policy-Rules      |
         |----------------------------->|
         |                              |
         |        ....                  |

         Figure 11: RADIUS server requesting location information

   The Requested-Info attribute MUST be sent by the RADIUS server, in
   the absence of an out-of-band agreement, if it wants the RADIUS
   client to return location information and if authorization policies
   permit it.  This Requested-Info attribute MAY appear in the Access-
   Accept or in the Access-Challenge message.

   A summary of the attribute is shown below.












Tschofenig, et al.      Expires December 26, 2007              [Page 25]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |    Length     |            Integer           ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       Integer (cont.)         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


     Type:

       To Be Assigned by IANA - Requested-Info Attribute

     Length:

       6

     Integer:

       The content of the Integer field encodes the
       requested information attributes.
       Each capability value represents a bit position.

   This document specifies the following capabilities:

   Name:

      CIVIC_LOCATION


   Description:

      The RADIUS server uses this attribute to request information from
      the RADIUS client to be returned.  The numerical value
      representing CIVIC_LOCATION requires the RADIUS client to attach
      civic location attributes.  CIVIC_LOCATION refers to the location
      profile defined in Section 4.3.1.


   Numerical Value:

      A numerical value of this attribute is '1'.









Tschofenig, et al.      Expires December 26, 2007              [Page 26]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Name:

      GEO_LOCATION


   Description:

      The RADIUS server uses this attribute to request information from
      the RADIUS client to be returned.  The numerical value
      representing GEO_LOCATION requires the RADIUS client to attach
      geospatial location attributes.  GEO_LOCATION refers to the
      location profile described in Section 4.3.2.


   Numerical Value:

      A numerical value of this attribute is '2'.


   Name:

      USERS_LOCATION


   Description:

      The numerical value representing USERS_LOCATION indicates that the
      RADIUS client must sent a Location-Information attribute with the
      Entity attribute expressing the value of zero (0).  Hence, there
      is a one-to-one relationship between USERS_LOCATION token and the
      value of zero (0) of the Entity attribute inside the Location-
      Information attribute.  A value of zero indicates that the
      location information in the Location-Information attribute refers
      to the user's client device.


   Numerical Value:

      A numerical value of this attribute is '4'.


   Name:

      NAS_LOCATION







Tschofenig, et al.      Expires December 26, 2007              [Page 27]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Description:

      The numerical value representing NAS_LOCATION indicates that the
      RADIUS client must sent a Location-Information attribute that
      contains location information with the Entity attribute expressing
      the value of one (1).  Hence, there is a one-to-one relationship
      between NAS_LOCATION token and the value of one (1) of the Entity
      attribute inside the Location-Information attribute.  A value of
      one indicates that the location information in the Location-
      Information attribute refers to the RADIUS client.


   Numerical Value:

      A numerical value of this attribute is '8'.


   Name:

      FUTURE_REQUESTS


   Description:

      The numerical value representing FUTURE_REQUESTS indicates that
      the RADIUS client MUST provide future Access-Requests with the
      same information as returned in the initial Access-Request
      message.


   Numerical Value:

      A numerical value of this attribute is '16'.


   If neither the NAS_LOCATION nor the USERS_LOCATION bit is set then
   per-default the location of the user's client device is returned (if
   authorization policies allow it).  If both the NAS_LOCATION and the
   USERS_LOCATION bits are set then the returned location information
   has to be put into separate attributes.  If neither the
   CIVIC_LOCATION nor the GEO_LOCATION bit is set in the Requested-Info
   attribute then no location information is returned.  If both the
   CIVIC_LOCATION and the GEO_LOCATION bits are set then the location
   information has to be put into separate attributes.  The value of
   NAS_LOCATION and USERS_LOCATION refers to the location information
   requested via CIVIC_LOCATION and via GEO_LOCATION.

   As an example, if the bits for NAS_LOCATION, USERS_LOCATION and



Tschofenig, et al.      Expires December 26, 2007              [Page 28]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   GEO_LOCATION are set then location information of the RADIUS client
   and the users' client device are returned in a geospatial location
   format.
















































Tschofenig, et al.      Expires December 26, 2007              [Page 29]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


5.  Table of Attributes

   The following table provides a guide which attributes may be found in
   which RADIUS messages, and in what quantity.


   Request Accept Reject Challenge Accounting  #  Attribute
                                   Request
   0-1     0      0      0         0-1        TBD  Operator-Name
   0+      0      0      0         0+         TBD  Location-Information
   0+      0      0      0         0+         TBD  Location-Data
   0-1     0-1    0-1    0-1       0-1        TBD  Basic-Policy-Rules
   0-1     0-1    0-1    0-1       0-1        TBD  Extended-Policy-Rules
   0       0-1    0      0-1       0          TBD  Requested-Info
   0-1     0      0      0         0          TBD  Location-Capable
   0       0      0-1    0         0          101  Error-Cause [note1]

   [note1] The Error-Cause attribute contains the value for the
   'Location-Info-Required' error.

   The following table defines the meaning of the above table entries.

      0     This attribute MUST NOT be present.
      0+    Zero or more instances of this attribute MAY be present.
      0-1   Zero or one instance of this attribute MAY be present.
      1     Exactly one instance of this attribute MUST be present.
      1+    One or more of these attributes MUST be present.

                      Figure 13: Table of Attributes

   The Error-Cause attribute is defined in [3].

   The Location-Information and the Location-Data attribute MAY appear
   more than once.  For example, if the server asks for civic and
   geospatial location information two Location-Information attributes
   need to be sent.

   The attributes defined in this document are not used in any messages
   other than the onces listed in Figure 13.

   This document requests IANA to allocate a new value from the Error-
   Cause registry with the semantic of 'Location-Info-Required'.









Tschofenig, et al.      Expires December 26, 2007              [Page 30]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


6.  Diameter RADIUS Interoperability

   When used in Diameter, the attributes defined in this specification
   can be used as Diameter AVPs from the Code space 1-255 (RADIUS
   attribute compatibility space).  No additional Diameter Code values
   are therefore allocated.  The data types and flag rules for the
   attributes are as follows:


                                     +---------------------+
                                     |    AVP Flag rules   |
                                     |----+-----+----+-----|----+
                                     |    |     |SHLD| MUST|    |
    Attribute Name        Value Type |MUST| MAY | NOT|  NOT|Encr|
   ----------------------------------|----+-----+----+-----|----|
    Operator-Name         OctetString|    | P,M |    |  V  | Y  |
    Location-Information  OctetString| M  |  P  |    |  V  | Y  |
    Location-Data         OctetString| M  |  P  |    |  V  | Y  |
    Basic-Policy-Rules    OctetString| M  |  P  |    |  V  | Y  |
    Extended-Policy-Rules OctetString| M  |  P  |    |  V  | Y  |
    Requested-Info        OctetString| M  |  P  |    |  V  | Y  |
    Location-Capable      OctetString|    | P,M |    |  V  | Y  |
   ----------------------------------|----+-----+----+-----|----|

   The attributes in this specification have no special translation
   requirements for Diameter to RADIUS or RADIUS to Diameter gateways;
   they are copied as is, except for changes relating to headers,
   alignment, and padding.  See also Section 4.1 of [6] and Section 9 of
   [18].

   What this specification says about the applicability of the
   attributes for RADIUS Access-Request packets applies in Diameter to
   AA-Request [18] or Diameter-EAP-Request [19].  What is said about
   Access-Challenge applies in Diameter to AA-Answer [18] or Diameter-
   EAP-Answer [19] with Result-Code AVP set to
   DIAMETER_MULTI_ROUND_AUTH.  What is said about Access-Accept applies
   in Diameter to AA-Answer or Diameter-EAP-Answer messages that
   indicate success.  Similarly, what is said about RADIUS Access-Reject
   packets applies in Diameter to AA-Answer or Diameter-EAP-Answer
   messages that indicate failure.

   What is said about COA-Request applies in Diameter to Re-Auth-Request
   [18].

   What is said about Accounting-Request applies to Diameter Accounting-
   Request [18] as well.





Tschofenig, et al.      Expires December 26, 2007              [Page 31]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


7.  Security Considerations

   A number of security aspects are relevant for the distribution of
   location information via RADIUS.  These aspects are discussed in
   separate sub-sections.

7.1.  Communication Security

   Requirements for the protection of a Location Object are defined in
   [9], namely mutual end-point authentication, data object integrity,
   data object confidentiality and replay protection.

   If no authentication, integrity and replay protection between the
   participating RADIUS entities is provided then adversaries can spoof
   and modify transmitted attributes.  Two security mechanisms are
   proposed for RADIUS:

   o  [2] proposes the usage of a static key that raised concerns
      regarding the lack dynamic key management.  At the time of
      writing, work is ongoing to address some shortcomings of [2]
      attribute security protection.

   o  RADIUS over IPsec [20] enables the use of standard key management
      mechanisms, such as KINK, IKE and IKEv2 [21], to establish IPsec
      security associations.  Confidentiality protection MUST be used to
      prevent eavesdropper gaining access to location information.
      Confidentiality protection is not only a property required by this
      document, it is also required for the transport of keying material
      in the context of EAP authentication and authorization.  Hence,
      this requirement is, in many environments, already fulfilled.
      Mutual authentication MUST be provided between neighboring RADIUS
      entities to prevent man-in-the-middle attacks.  Since mutual
      authentication is already required for key transport within RADIUS
      messages it does not represent a deployment obstacle.  Since IPsec
      protection is suggested as a mechanism to protect RADIUS already
      no additional considerations need to be addressed beyond those
      described in [20].

   In case that IPsec protection is not available for some reason and
   RADIUS specific security mechanisms have to be used then the
   following considerations apply.  The Access-Request message is not
   integrity protected.  This would allow an adversary to change the
   contents of the Location Object or to insert, modify and delete
   attributes or individual fields.  To address these problems the
   Message-Authenticator (80) can be used to integrity protect the
   entire Access-Request packet.  The Message-Authenticator (80) is also
   required when EAP is used and hence is supported by many modern
   RADIUS servers.



Tschofenig, et al.      Expires December 26, 2007              [Page 32]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Access-Request packets including Location attribute(s) without a
   Message-Authenticator(80) attribute SHOULD be silently discarded by
   the RADIUS server.  A RADIUS server supporting location attributes
   MUST calculate the correct value of the Message-Authenticator(80) and
   MUST silently discard the packet if it does not match the value sent.

   Access-Accept, including Location attribute(s) without a Message-
   Authenticator(80) attribute SHOULD be silently discarded by the NAS.
   A NAS supporting location attributes MUST calculate the correct value
   of a received Message-Authenticator(80) and MUST silently discard the
   packet if it does not match the value sent.

   RADIUS and Diameter make some assumptions about the trust between
   traversed RADIUS entities in the sense that object level security is
   not provided by neither RADIUS nor Diameter.  Hence, some trust has
   to be placed on the RADIUS entities to behave according to the
   defined rules.  Furthermore, the RADIUS protocol does not involve the
   user in their protocol interaction except for tunneling
   authentication information (such as EAP messages) through their
   infrastructure.  RADIUS and Diameter have even become a de-facto
   protocol for key distribution for network access authentication
   applications.  Hence, in the past there were some concerns about the
   trust placed into the infrastructure particularly from the security
   area when it comes to keying.  The EAP keying infrastructure is
   described in [22].

7.2.  Privacy Considerations

   This section discusses privacy implications for the distribution of
   location information within RADIUS.  Note also that it is possible
   for the RADIUS server to obtain some amount of location information
   from the NAS identifier.  This document, however, describes
   procedures to convey more accurate location information about the end
   host and/or the network.  In a number of deployment environments
   location information about the network also reveals the current
   location of the user with a certain degree of precision depending on
   the location determination mechanism used, update frequency, the size
   of the network and other factors, such as movement traces.

   Three types of use cases have to be differentiated:

   o  RADIUS server does not want to receive location information from
      the RADIUS client.

   o  In case there is an out-of-band agreement between the entity
      responsible for the NAS and the entity operating the RADIUS server
      then location information may be sent without an explicit request
      from the RADIUS server.



Tschofenig, et al.      Expires December 26, 2007              [Page 33]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   o  The RADIUS server dynamically requests location information from
      the NAS.

7.2.1.  RADIUS Client

   The RADIUS client MUST behave according to the following guidelines:

   o  If neither an out-of-band agreement exists nor location
      information is requested by the RADIUS server then location
      information is not disclosed by the RADIUS client.

   o  The RADIUS client MUST pass location information to other entities
      (e.g., when information is written to a local database or to the
      log files) only together with the policy rules.  The entity
      receiving the location information (together with the policies)
      MUST follow the guidance given with these rules.

   o  A RADIUS client MUST include Basic-Policy-Rules and Extended-
      Policy-Rules attributes that are configured within an Access-
      Request packet.

   o  NAS implementations supporting this specification, which are
      configured to provide location information, MUST echo Basic-
      Policy-Rules and Extended-Policy-Rules attributes unmodified
      within a subsequent Access-Request packet.  In addition, an
      Access-Request packet sent with a Service-Type value of "Authorize
      Only" MUST include Basic-Policy-Rules or Extended-Policy-Rules
      attributes received in a previous Access-Accept if the
      FUTURE_REQUESTS flag was set in the Requested-Info attribute.

7.2.2.  RADIUS Server

   The RADIUS server is a natural place for storing authorization
   policies since the user typically has some sort of trust relationship
   with the entity operating the RADIUS server.  Once the infrastructure
   is deployed and location aware applications are available then there
   might be a strong desire to use location information for other
   purposes as well.

      The Common Policy framework [23] that was extended for geolocation
      privacy [24] are tailored for this purpose.  The Extensible Markup
      Language (XML) Configuration Access Protocol (XCAP) [25] gives
      users the ability to change their privacy policies using a
      standardized protocol.  These policies are an important tool for
      limiting further distribution of the user's location to other
      location based services.

   The RADIUS server MUST behave according to the following guidelines:



Tschofenig, et al.      Expires December 26, 2007              [Page 34]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   o  The RADIUS server MUST attach available rules to the Access-
      Accept, the Access-Reject or the Access-Challenge message when the
      RADIUS client is supposed to provide location information.

   o  When location information is made available to other entities
      (e.g., writing to stable storage for latter billing processing)
      then the RADIUS server MUST attach the privacy rules to location
      information.

7.2.3.  RADIUS Proxy

   A RADIUS proxy, behaving as a combined RADIUS client and RADIUS
   server, MUST follow the rules described in Section 7.2.1 and
   Section 7.2.2.

7.3.  Identity Information and Location Information

   For the envisioned usage scenarios, the identity of the user and his
   device is tightly coupled to the transfer of location information.
   If the identity can be determined by the visited network or RADIUS
   brokers, then it is possible to correlate location information with a
   particular user.  As such, it allows the visited network and brokers
   to learn movement patterns of users.

   The user's identity can be "leaked" to the visited network or RADIUS
   brokers in a number of ways:

   o  The user's device may employ a fixed MAC address, or base its IP
      address on such an address.  This enables the correlation of the
      particular device to its different locations.  Techniques exist to
      avoid the use of an IP address that is based on MAC address [26].
      Some link layers make it possible to avoid MAC addresses or change
      them dynamically.

   o  Network access authentication procedures, such as PPP CHAP [27] or
      EAP [22], may reveal the user's identity as a part of the
      authentication procedure.  Techniques exist to avoid this problem
      in EAP methods, for instance by employing private Network Access
      Identifiers (NAIs) in the EAP Identity Response message [28] and
      by method-specific private identity exchange in the EAP method
      (e.g., [28], [29] [30], [31]).  Support for identity privacy
      within CHAP is not available.

   o  RADIUS may return information from the home network to the visited
      in a manner that makes it possible to either identify the user or
      at least correlate his session with other sessions, such as the
      use of static data in a Class attribute [2] or in some accounting
      attribute usage scenarios [32].



Tschofenig, et al.      Expires December 26, 2007              [Page 35]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   o  Mobility protocols may reveal some long-term identifier, such as a
      home address.

   o  Application layer protocols may reveal other permanent
      identifiers.

   To prevent the correlation of identities with location information it
   is necessary to prevent leakage of identity information from all
   sources, not just one.

   Unfortunately, most users are not educated about the importance of
   identity confidentiality and some protocols lack support for identity
   privacy mechanisms.  This problem is made worse by the fact that
   users may be unable to choose particular protocols, as the choice is
   often dictated by the type of network operator they use, by the type
   of network they wish to access, the kind of equipment they have, or
   the type of authentication method they are using.

   A scenario where the user is attached to the home network is, from a
   privacy point of view, simpler than a scenario where a user roams
   into a visited network since the NAS and the home RADIUS server are
   in the same administrative domain.  No direct relationship between
   the visited and the home network operator may be available and some
   RADIUS brokers need to be consulted.  With subscription-based network
   access as used today the user has a contractual relationship with the
   home network provider that could (theoretically) allow higher privacy
   considerations to be applied (including policy rules stored at the
   home network itself for the purpose of restricting further
   distribution).

   In many cases it is necessary to secure the transport of location
   information along the RADIUS infrastructure.  Mechanisms to achieve
   this functionality are discussed in Section 7.1.


















Tschofenig, et al.      Expires December 26, 2007              [Page 36]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


8.  IANA Considerations

   The authors request that the Attribute Types, and Attribute Values
   defined in this document be registered by the Internet Assigned
   Numbers Authority (IANA) from the RADIUS name spaces as described in
   the "IANA Considerations" section of RFC 3575 [7], in accordance with
   BCP 26 [8].  Additionally, the Attribute Type should be registered in
   the Diameter name space.  For RADIUS attributes and registries
   created by this document IANA is requested to place them at
   http://www.iana.org/assignments/radius-types.

   This document defines the following attributes:


         Operator-Name
         Location-Information
         Location-Data
         Basic-Policy-Rules
         Extended-Policy-Rules
         Location-Capable
         Requested-Info

   Please refer to Section 5 for the registered list of numbers.

   This document also instructs IANA to assign a new value for the
   Error-Cause attribute [3], of "Location-Info-Required" TBA.

   Additionally, IANA is requested to create the following new
   registries listed in the subsections below.

8.1.  New Registry: Operator Namespace Identifier

   This document also defines an operator namespace identifier registry
   (used in the Namespace ID field of the Operator-Name attribute).
   Note that this document requests IANA only to maintain a registry of
   existing namespaces for use in this identifier field, and not to
   establish any namespaces nor to place any values within namespaces.

   IANA is requested to add the following values to the operator
   namespace identifier registry using a numerical identifier (allocated
   in sequence), a token for the operator namespace and a contact person
   for the registry.









Tschofenig, et al.      Expires December 26, 2007              [Page 37]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


  +----------+--------------------+------------------------------------+
  |Identifier| Operator Namespace | Contact Person                     |
  |          | Token              |                                    |
  +----------+--------------------+------------------------------------+
  |    48    | TADIG              | TD.13 Coordinator                  |
  |          |                    | (td13@gsm.org)                     |
  |    49    | REALM              | IETF O&M Area Directors            |
  |          |                    | (ops-chairs@ietf.org)              |
  |    50    | E212               | ITU Director                       |
  |          |                    | (tsbdir@itu.int)                   |
  |    51    | ICC                | ITU Director                       |
  |          |                    | (tsbdir@itu.int)                   |
  +----------+--------------------+------------------------------------+

   Note that the above identifier values represent the ASCII value '0'
   (decimal 48), '1' (decimal 49), '2' (decimal 50) and '3' (decimal
   51).  This encoding was chosen to simplify parsing.

   Requests to IANA for a new value for a Namespace ID will be approved
   by Expert Review.  The Designated Expert Reviewer team for these
   requests is the current Operations Area Director and the RADEXT
   working group chairs or the working group chairs of a designated
   successor working group.

   The Expert Reviewer should ensure that a new entry is indeed required
   or could fit within an existing database, e.g., whether there is a
   real requirement to provide a token for an Namespace ID because one
   is already up and running, or whether the REALM identifier plus the
   name should recommended to the requester.  In addition, the Expert
   Reviewer should ascertain to some reasonable degree of diligence that
   a new entry is a correct reference to an Operator Namespace, when a
   new one is registered.

8.2.  New Registry: Location Profiles

   Section 4.2 defines the Location-Information attribute and a Code
   field that contains 8 bit integer value.  Two values, zero and one,
   are defined in this document, namely:

   Value (0): Civic location profile described in Section 4.3.1

   Value (1): Geospatial location profile described in Section 4.3.2

   The remaining values are reserved for future use.

   Following the policies outline in [7] the available bits with a
   description of their semantic will be assigned after Expert Review
   initiated by the O&M Area Directors in consultation with the RADEXT



Tschofenig, et al.      Expires December 26, 2007              [Page 38]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   working group chairs or the working group chairs of a designated
   successor working group.  Updates can be provided based on expert
   approval only.  A designated expert will be appointed by the O&M Area
   Directors.  No mechanism to mark entries as "deprecated" is
   envisioned.  Based on expert approval it is possible to delete
   entries from the registry.

   Each registration must include the value and the corresponding
   semantic of the defined location profile.

8.3.  New Registry: Location Capable Attribute

   Section 4.6 defines the Location-Capable attribute that contains a
   bit map. 32 bits are available whereby a single bit, bit (0),
   indicating 'Location Capable' is defined by this document.  Bits 1-15
   are reserved for future use.

   Following the policies outline in [7] the available bits with a
   description of their semantic will be assigned after Expert Review
   initiated by the O&M Area Directors in consultation with the RADEXT
   working group chairs or the working group chairs of a designated
   successor working group.  Updates can be provided based on expert
   approval only.  A designated expert will be appointed by the O&M Area
   Directors.  No mechanism to mark entries as "deprecated" is
   envisioned.  Based on expert approval it is possible to delete
   entries from the registry.

   Each registration must include the bit position and the semantic of
   the bit.

8.4.  New Registry: Entity Types

   Section 4.2 defines the Location-Information attribute that contains
   an 8 bit Entity field.  Two values are registered by this document,
   namely:

   Value (0) describes the location of the user's client device

   Value (1) describes the location of the RADIUS client

   All other values are reserved for future use.

   Following the policies outline in [7] the available bits with a
   description of their semantic will be assigned after Expert Review
   initiated by the O&M Area Directors in consultation with the RADEXT
   working group chairs or the working group chairs of a designated
   successor working group.  Updates can be provided based on expert
   approval only.  A designated expert will be appointed by the O&M Area



Tschofenig, et al.      Expires December 26, 2007              [Page 39]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Directors.  No mechanism to mark entries as "deprecated" is
   envisioned.  Based on expert approval it is possible to delete
   entries from the registry.

   Each registration must include the value and a corresponding
   description.

8.5.  New Registry: Privacy Flags

   Section 4.4 defines the Basic Policy Rules attribute that contains
   flags indicating privacy settings. 16 bits are available whereby a
   single bit, bit (0), indicating 'retransmission allowed' is defined
   by this document.  Bits 1-15 are reserved for future use.

   Following the policies outline in [7] the available bits with a
   description of their semantic will be assigned after Expert Review
   initiated by the O&M Area Directors in consultation with the RADEXT
   working group chairs or the working group chairs of a designated
   successor working group.  Updates can be provided based on expert
   approval only.  A designated expert will be appointed by the O&M Area
   Directors.  No mechanism to mark entries as "deprecated" is
   envisioned.  Based on expert approval it is possible to delete
   entries from the registry.

   Each registration must include the bit position and the semantic of
   the bit.

8.6.  New Registry: Requested-Info Attribute

   Section 4.7 defines the Requested-Info attribute that contains a bit
   map. 32 bits are available whereby a 5 bits are defined by this
   document.  This document creates a new IANA registry for the
   Requested-Info attribute.  IANA is requested to add the following
   values to this registry:


    +----------+----------------------+
    |  Value   | Capability Token     |
    +----------+----------------------+
    |    1     | CIVIC_LOCATION       |
    |    2     | GEO_LOCATION         |
    |    4     | USERS_LOCATION       |
    |    8     | NAS_LOCATION         |
    |   16     | FUTURE_REQUESTS      |
    +----------+----------------------+

   The semantic of these values is defined in Section 4.7.




Tschofenig, et al.      Expires December 26, 2007              [Page 40]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Following the policies outline in [7] new Capability Tokens with a
   description of their semantic for usage with the Requested-Info
   attribute will be assigned after Expert Review initiated by the O&M
   Area Directors in consultation with the RADEXT working group chairs
   or the working group chairs of a designated successor working group.
   Updates can be provided based on expert approval only.  A designated
   expert will be appointed by the O&M Area Directors.  No mechanism to
   mark entries as "deprecated" is envisioned.  Based on expert approval
   it is possible to delete entries from the registry.

   Each registration must include:

   Name:

      Capability Token (i.e., an identifier of the capability)


   Description:

      Brief description indicating the meaning of the info element.


   Numerical Value:

      A numerical value that is placed into the Capability attribute
      representing a bit in the bit-string of the Requested-Info
      attribute.
























Tschofenig, et al.      Expires December 26, 2007              [Page 41]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


9.  Acknowledgments

   The authors would like to thank the following people for their help
   with an initial version of this draft and for their input: Chuck
   Black, Paul Congdon, Jouni Korhonen, Sami Ala-luukko, Farooq Bari, Ed
   Van Horne, Mark Grayson, Jukka Tuomi, Jorge Cuellar, and Christian
   Guenther.

   Henning Schulzrinne provided the civic location information content
   found in this draft.  The geospatial location information format is
   based on work done by James Polk, John Schnizlein and Marc Linsner.
   The authorization policy format is based on the work done by Jon
   Peterson.

   The authors would like to thank Victor Lortz, Jose Puthenkulam,
   Bernrad Aboba, Jari Arkko, Parviz Yegani, Serge Manning, Kuntal
   Chowdury, Pasi Eronen, Blair Bullock and Eugene Chang for their
   feedback to an initial version of this draft.  We would like to thank
   Jari Arkko for his text contributions.  Lionel Morand provided
   detailed feedback on numerous issues.  His comments helped to improve
   the quality of this document.  Jouni Korhonen and John Loughney
   helped us with the Diameter RADIUS interoperability.  Andreas
   Pashalidis reviewed a later version document and provided a number of
   comments.  Bernard Aboba, Alan DeKok, Lionel Morand, Jouni Korhonen,
   David Nelson and Emile van Bergen provided guidance on the Requested-
   Info attribute and participated in the capability exchange
   discussions.  Allison Mankin, Jouni Korhonen and Pasi Eronen provided
   text for the operator namespace identifier registry.  Jouni Korhonen
   interacted with the GSMA to find a contact person for the TADIG
   operator namespace and Scott Bradner consulted the ITU-T to find a
   contact person for the E212 and the ICC operator namespace.

   This document is based on the discussions within the IETF GEOPRIV
   working group.  Therefore, the authors thank Henning Schulzrinne,
   James Polk, John Morris, Allison Mankin, Randall Gellens, Andrew
   Newton, Ted Hardie, Jon Peterson for their time to discuss a number
   of issues with us.  We thank Stephen Hayes for aligning this work
   with 3GPP activities.

   The RADEXT working group chairs, David Nelson and Bernard Aboba,
   provided several draft reviews and we would like to thank them for
   the help and their patience.

   Finally, we would like to thank Bernard Aboba and Dan Romascanu for
   the IETF Last Call comments, Derek Atkins for his security area
   directorate review and Yoshiko Chong for spotting a bug in the IANA
   consideration section.  Bernard spend of lot of his time to interact
   with the authors to resolve the IETF LC issues he raised.  We would



Tschofenig, et al.      Expires December 26, 2007              [Page 42]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   like to thank him for the energie he spend on this document.


















































Tschofenig, et al.      Expires December 26, 2007              [Page 43]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


10.  References

10.1.  Normative References

   [1]   Bradner, S., "Key words for use in RFCs to Indicate Requirement
         Levels", BCP 14, RFC 2119, March 1997.

   [2]   Rigney, C., Willens, S., Rubens, A., and W. Simpson, "Remote
         Authentication Dial In User Service (RADIUS)", RFC 2865,
         June 2000.

   [3]   Chiba, M., Dommety, G., Eklund, M., Mitton, D., and B. Aboba,
         "Dynamic Authorization Extensions to Remote Authentication Dial
         In User Service (RADIUS)", RFC 3576, July 2003.

   [4]   Schulzrinne, H., "Dynamic Host Configuration Protocol (DHCPv4
         and DHCPv6) Option for Civic Addresses Configuration
         Information", RFC 4776, November 2006.

   [5]   Polk, J., Schnizlein, J., and M. Linsner, "Dynamic Host
         Configuration Protocol Option for Coordinate-based Location
         Configuration Information", RFC 3825, July 2004.

   [6]   Calhoun, P., Loughney, J., Guttman, E., Zorn, G., and J. Arkko,
         "Diameter Base Protocol", RFC 3588, September 2003.

   [7]   Aboba, B., "IANA Considerations for RADIUS (Remote
         Authentication Dial In User Service)", RFC 3575, July 2003.

   [8]   Narten, T. and H. Alvestrand, "Guidelines for Writing an IANA
         Considerations Section in RFCs", BCP 26, RFC 2434,
         October 1998.

10.2.  Informative References

   [9]   Cuellar, J., Morris, J., Mulligan, D., Peterson, D., and D.
         Polk, "Geopriv Requirements", RFC 3693, February 2004.

   [10]  Rigney, C., "RADIUS Accounting", RFC 2866, June 2000.

   [11]  Chiba, M., "Dynamic Authorization Extensions to Remote
         Authentication Dial In User  Service (RADIUS)",
         draft-ietf-radext-rfc3576bis-08 (work in progress), June 2007.

   [12]  "TADIG Naming Conventions, Version 4.1", GSM Association
         Official Document TD.13",  , June 2006.

   [13]  "The international identification plan for mobile terminals and



Tschofenig, et al.      Expires December 26, 2007              [Page 44]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


         mobile users, ITU-T Recommendation E.212",  , May 2004.

   [14]  "Designations for interconnections among operators' networks,
         ITU-T Recommendation M.1400",  , January 2004.

   [15]  "Codes for the representation of names of countries and their
         subdivisions - Part 1: Country codes, ISO 3166-1",  , 1997.

   [16]  Mills, D., "Network Time Protocol (Version 3) Specification,
         Implementation", RFC 1305, March 1992.

   [17]  Peterson, J., "A Presence-based GEOPRIV Location Object
         Format", RFC 4119, December 2005.

   [18]  Calhoun, P., Zorn, G., Spence, D., and D. Mitton, "Diameter
         Network Access Server Application", RFC 4005, August 2005.

   [19]  Eronen, P., Hiller, T., and G. Zorn, "Diameter Extensible
         Authentication Protocol (EAP) Application", RFC 4072,
         August 2005.

   [20]  Aboba, B. and P. Calhoun, "RADIUS (Remote Authentication Dial
         In User Service) Support For Extensible Authentication Protocol
         (EAP)", RFC 3579, September 2003.

   [21]  Kaufman, C., "Internet Key Exchange (IKEv2) Protocol",
         RFC 4306, December 2005.

   [22]  Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The Network
         Access Identifier", RFC 4282, December 2005.

   [23]  Schulzrinne, H., Tschofenig, H., Morris, J., Cuellar, J., Polk,
         J., and J. Rosenberg, "Common Policy: A Document Format for
         Expressing Privacy Preferences", RFC 4745, February 2007.

   [24]  Schulzrinne, H., "Geolocation Policy: A Document Format for
         Expressing Privacy Preferences for  Location Information",
         draft-ietf-geopriv-policy-12 (work in progress), May 2007.

   [25]  Rosenberg, J., "The Extensible Markup Language (XML)
         Configuration Access Protocol (XCAP)",
         draft-ietf-simple-xcap-12 (work in progress), October 2006.

   [26]  Narten, T. and R. Draves, "Privacy Extensions for Stateless
         Address Autoconfiguration in IPv6", RFC 3041, January 2001.

   [27]  Simpson, W., "PPP Challenge Handshake Authentication Protocol
         (CHAP)", RFC 1994, August 1996.



Tschofenig, et al.      Expires December 26, 2007              [Page 45]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   [28]  Arkko, J. and H. Haverinen, "Extensible Authentication Protocol
         Method for 3rd Generation Authentication and Key Agreement
         (EAP-AKA)", RFC 4187, January 2006.

   [29]  Funk, P. and S. Blake-Wilson, "EAP Tunneled TLS Authentication
         Protocol Version 0 (EAP-TTLSv0)", draft-funk-eap-ttls-v0-01
         (work in progress), April 2007.

   [30]  Josefsson, S., Palekar, A., Simon, D., and G. Zorn, "Protected
         EAP Protocol (PEAP) Version 2",
         draft-josefsson-pppext-eap-tls-eap-10 (work in progress),
         October 2004.

   [31]  Tschofenig, H., "EAP IKEv2 Method",
         draft-tschofenig-eap-ikev2-13 (work in progress), March 2007.

   [32]  Adrangi, F., Lior, A., Korhonen, J., and J. Loughney,
         "Chargeable User Identity", RFC 4372, January 2006.

   [33]  "Open Geography Markup Language (GML) Implementation
         Specification", OGC 02-023r4,
         http://www.opengis.org/techno/implementation.htm",  ,
         January 2003.

   [34]  Stanley, D., Walker, J., and B. Aboba, "Extensible
         Authentication Protocol (EAP) Method Requirements for Wireless
         LANs", RFC 4017, March 2005.

   [35]  Danley, M., "Threat Analysis of the Geopriv Protocol",
         RFC 3694, September 2003.

   [36]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A.,
         Peterson, J., Sparks, R., Handley, M., and E. Schooler, "SIP:
         Session Initiation Protocol", RFC 3261, June 2002.

   [37]  Polk, J. and B. Rosen, "Session Initiation Protocol Location
         Conveyance", draft-ietf-sip-location-conveyance-07 (work in
         progress), February 2007.













Tschofenig, et al.      Expires December 26, 2007              [Page 46]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


Appendix A.  Matching with Geopriv Requirements

   This section compares the requirements for a GEOPRIV Using Protocol,
   described in [9], against the approach of distributing Location
   Objects with RADIUS.

   In Appendix A.1 and Appendix A.2 we discuss privacy implications when
   RADIUS entities make location information available to other parties.
   In Appendix A.3 the requirements are matched against these two
   scenarios.

A.1.  Distribution of Location Information at the User's Home Network

   When location information is conveyed from the RADIUS client to the
   RADIUS server then it might subsequently be made available for
   different purposes.  This section discusses the privacy implication
   for making location information available to other entities.

   To use a more generic scenario we assume that the visited RADIUS and
   the home RADIUS server belong to different administrative domains.
   The Location Recipient obtains location information about a
   particular Target via protocols specified outside the scope of this
   document (e.g., SIP, HTTP or an API).

   The subsequent figure shows the interacting entities graphically.


   visited network    |        home network
                      |
                      |        +----------+
                      |        |  Rule    |
                      |        | Holder   |
                      |        +----+-----+
                      |             |
                      |         rule|interface
    +----------+      |             V                     +----------+
    |Location  |      |        +----------+  notification |Location  |
    |Generator |      |        |Location  |<------------->|Recipient |
    +----------+  publication  |Server    |  interface    |          |
    |RADIUS    |<------------->+----------+               +----------+
    |Client    |  interface    |RADIUS    | E.g., SIP/HTTP
    +----------+      |        |Server    |
                      |        +----------+
    E.g., NAS       RADIUS
                      |
                      |

              Figure 18: Location Server at the Home Network



Tschofenig, et al.      Expires December 26, 2007              [Page 47]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   The term 'Rule Holder' in Figure 18 denotes the entity that creates
   the authorization rule set.

A.2.  Distribution of Location Information at the Visited Network

   This section describes a scenario where location information made
   available to Location Recipients by a Location Server in the visited
   network.  Some identifier needs to be used as an index within the
   location database.  One possible identifier is the Network Access
   Identifier.  RFC 4282 [22] and RFC 4372 [32] provide background
   whether entities in the visited network can obtain the user's NAI in
   cleartext.

   The visited network provides location information to a Location
   Recipient (e.g., via SIP or HTTP).  This document enables the NAS to
   obtain the user's privacy policy via the interaction with the RADIUS
   server.  Otherwise only default policies, which are very restrictive,
   are available.  This allows the Location Server in the visited
   network to ensure act according to the user's policies.

   The subsequent figure shows the interacting entities graphically.






























Tschofenig, et al.      Expires December 26, 2007              [Page 48]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


    visited network    |        home network
                       |
     +----------+      |
     |Location  |      |
     |Recipient |      |
     |          |      |
     +----------+      |
          ^            |        +----------+
          |            |        |  Rule    |
      notification     |        | Holder   |
       interface       |        |          |
          |            |        +----+-----+
          |            |             |
          |            |         rule|interface
          v            |             |
     +----------+      |             |
     |Location  |      |             v
     |Server    |      |        +----------+
     +----------+ Rule Transport|RADIUS    |
     |RADIUS    |<------------->|Server    |
     |Client    |   RADIUS      +----------+
     +----------+      |
     |Location  |      |
     |Generator |
     +----------+

             Figure 19: Location Server at the Visited Network

   Location information always travels with privacy policies.  This
   document enables the RADIUS client to obtain these policies.  The
   Location Server can subsequently act according to these policies to
   provide access control using the extended policy rules and to adhere
   the privacy statements in the basic policy rules.

A.3.  Requirements matching

   Section 7.1 of [9] details the requirements of a "Location Object".
   We discuss these requirements in the subsequent list.

   Req. 1.  (Location Object generalities):

      *  Regarding requirement 1.1, the syntax and semantic of the
         location object is taken from the [5] and [4].  It is
         furthermore possible to convert it to the format used in GMLv3
         [33], as used with PIDF-LO [17].

      *  Regarding requirement 1.2, a number of fields in the civic
         location information format are optional.



Tschofenig, et al.      Expires December 26, 2007              [Page 49]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


      *  Regarding requirement 1.3, the inclusion of type of place item
         (CAtype 29) used in the DHCP civic format gives a further
         classification of the location.  This attribute can be seen as
         an extension.

      *  Regarding requirement 1.4, this document does not define the
         format of the location information.

      *  Regarding requirement 1.5, location information is only sent
         from the RADIUS client to the RADIUS server.

      *  Regarding requirement 1.6, the Location Object contains both
         location information and privacy rules.  Location information
         is described in Section 4.2, in Section 4.3.1 and in
         Section 4.3.2.  The corresponding privacy rules are detailed in
         Section 4.4 and in Section 4.5.

      *  Regarding requirement 1.7, the Location Object is usable in a
         variety of protocols.  The format of the object is reused from
         other documents as detailed in Section 4.2, Section 4.3.1,
         Section 4.3.2 Section 4.4 and in Section 4.5).

      *  Regarding requirement 1.8, the encoding of the Location Object
         has an emphasis on a lightweight encoding format to be used
         with RADIUS.


   Req. 2.  (Location Object fields):

      *  Regarding requirement 2.1, the Target Identifier is carried
         within the network access authentication protocol (e.g., within
         the EAP-Identity Response when EAP is used and/or within the
         EAP method itself).  As described in Section 7.2 it has a
         number of advantages if this identifier is not carried in
         clear.  This is possible with certain EAP methods whereby the
         identity in the EAP-Identity Response only contains information
         relevant for routing the response to the user's home network.
         The user identity is protected by the authentication and key
         exchange protocol.

      *  Regarding requirement 2.2, the Location Recipient is in the
         main scenario the home RADIUS server.  For a scenario where the
         Location Recipient is obtaining Location Information from the
         Location Server via HTTP or SIP the respective mechanisms
         defined in these protocols are used to identify the recipient.
         The Location Generator cannot, a priori, know the recipients if
         they are not defined in this protocol.




Tschofenig, et al.      Expires December 26, 2007              [Page 50]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


      *  Regarding requirement 2.3, the credentials of the Location
         Recipient are known to the RADIUS entities based on the
         security mechanisms defined in the RADIUS protocol itself.
         Section 7 describes these security mechanisms offered by the
         RADIUS protocol.  The same is true for requirement 2.4.

      *  Regarding requirement 2.5, Section 4.2, Section 4.3.1 and
         Section 4.3.2 describe the content of the location fields.
         Since the location format itself is not defined in this
         document motion and direction vectors as listed in requirement
         2.6 are not defined.

      *  Regarding requirement 2.6, this document provides the
         capability for the RADIUS server to indicate what type of
         location information it would like to see from the RADIUS
         client.

      *  Regarding requirement 2.7, timing information is provided with
         'sighting time' and 'time-to-live' field defined in
         Section 4.2.

      *  Regarding requirement 2.8, a reference to an external (more
         detailed rule set) is provided with the Section 4.5 attribute.

      *  Regarding requirement 2.9, security headers and trailers are
         provided as part of the RADIUS protocol or even as part of
         IPsec.

      *  Regarding requirement 2.10, a version number in RADIUS is
         provided with the IANA registration of the attributes.  New
         attributes are assigned a new IANA number.


   Req. 3.  (Location Data Types):

      *  Regarding requirement 3.1, this document reuses civic and
         geospatial location information as described in Section 4.3.2
         and in Section 4.3.1.

      *  With the support of civic and geospatial location information
         support requirement 3.2 is fulfilled.

      *  Regarding requirement 3.3, the geospatial location information
         used by this document only refers to absolute coordinates.
         However, the granularity of the location information can be
         reduced with the help of the AltRes, LoRes, LaRes fields
         described in [5].




Tschofenig, et al.      Expires December 26, 2007              [Page 51]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


      *  Regarding requirement 3.4, further Location Data Types can be
         added via new coordinate reference systems (CRSs) (see Datum
         field in [5]) and via extensions to [5] and [4].

   Section 7.2 of [9] details the requirements of a "Using Protocol".
   These requirements are listed below:


   Req. 4.:  The using protocol has to obey the privacy and security
      instructions coded in the Location Object regarding the
      transmission and storage of the LO.  This document requires that
      entities that aim to make location information available to third
      parties are required to obey the privacy instructions.


   Req. 5.:  The using protocol will typically facilitate that the keys
      associated with the credentials are transported to the respective
      parties, that is, key establishment is the responsibility of the
      using protocol.  Section 7 specifies how security mechanisms are
      used in RADIUS and how they can be reused to provide security
      protection for the Location Object.  Additionally, the privacy
      considerations (see Section 7.2) are also relevant for this
      requirement.


   Req. 6.  (Single Message Transfer):  In particular, for tracking of
      small target devices, the design should allow a single message/
      packet transmission of location as a complete transaction.  The
      encoding of the Location Object is specifically tailored towards
      the inclusion into a single message that even respects the (Path)
      MTU size.

   Section 7.3 of [9] details the requirements of a "Rule based Location
   Data Transfer".  These requirements are listed below:


   Req. 7.  (LS Rules):  With the scenario shown in Figure 18 the
      decision of a Location Server to provide a Location Recipient
      access to location information is based on Rule Maker-defined
      Privacy Rules that are stored at the home network.  With regard to
      the scenario shown in Figure 19 the Rule Maker-defined Privacy
      Rules are sent from the RADIUS server to the NAS (see Section 4.4,
      Section 4.5 and Section 7.2 for more details).








Tschofenig, et al.      Expires December 26, 2007              [Page 52]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Req. 8.  (LG Rules):  For all usage scenario it is possible to
      consider the privacy rule before transmitting location information
      from the NAS to the RADIUS server or even to third parties.  In
      the case of an out-of-band agreement between the owner of the NAS
      and the owner of the RADIUS server privacy might be applied on a
      higher granularity.  For the scenario shown in Figure 18 the
      visited network is already in possession of the users location
      information prior to the authentication and authorization of the
      user.  A correlation between the location and the user identity
      might, however, still not be possible for the visited network (as
      explained in Section 7.2).  A Location Server in the visited
      network has to evaluate available rulesets.


   Req. 9.  (Viewer Rules):  The Rule Maker might define (via mechanisms
      outside the scope of this document) which policy rules are
      disclosed to other entities.


   Req. 10.  (Full Rule language):  Geopriv has defined a rule language
      capable of expressing a wide range of privacy rules which is
      applicable in the area of the distribution of Location Objects.  A
      basic ruleset is provided with the Basic-Policy-Rules attribute
      Section 4.4.  A reference to the extended ruleset is carried in
      Section 4.5.  The format of these rules are described in [23] and
      [24].


   Req. 11.  (Limited Rule language):  A limited (or basic) ruleset is
      provided by the Policy-Information attribute Section 4.4 (and as
      introduced with PIDF-LO [17]).

   Section 7.4 of [9] details the requirements of a "Location Object
   Privacy and Security".  These requirements are listed below:


   Req. 12 (Identity Protection):  Support for unlinkable pseudonyms is
      provided by the usage of a corresponding authentication and key
      exchange protocol.  Such protocols are available, for example,
      with the support of EAP as network access authentication methods.
      Some EAP methods support passive user identity confidentiality
      whereas others even support active user identity confidentiality.
      This issue is further discussed in Section 7.  The importance for
      user identity confidentiality and identity protection has already
      been recognized as an important property (see, for example, a
      document on 'EAP Method Requirements for Wireless LANs' [34]).





Tschofenig, et al.      Expires December 26, 2007              [Page 53]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


   Req. 13.  (Credential Requirements):  As described in Section 7
      RADIUS signaling messages can be protected with IPsec.  This
      allows a number of authentication and key exchange protocols to be
      used as part of IKE, IKEv2 or KINK.


   Req. 14.  (Security Features):  Geopriv defines a few security
      requirements for the protection of Location Objects, such as
      mutual end-point authentication, data object integrity, data
      object confidentiality and replay protection.  As described in
      Section 7 these requirements are fulfilled with the usage of IPsec
      if mutual authentication refers to the RADIUS entities (acting as
      various Geopriv entities) which directly communicate with each
      other.


   Req. 15.  (Minimal Crypto):  A minimum of security mechanisms are
      mandated by the usage of RADIUS.  Communication security for
      Location Objects between RADIUS infrastructure elements is
      provided by the RADIUS protocol (including IPsec and its dynamic
      key management framework) rather than on relying on object
      security via S/SIME (which is not available with RADIUS).





























Tschofenig, et al.      Expires December 26, 2007              [Page 54]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


Authors' Addresses

   Hannes Tschofenig
   Nokia Siemens Networks
   Otto-Hahn-Ring 6
   Munich, Bavaria  81739
   Germany

   Email: Hannes.Tschofenig@nsn.com
   URI:   http://www.tschofenig.com


   Farid Adrangi
   Intel Corporatation
   2111 N.E. 25th Avenue
   Hillsboro OR
   USA

   Email: farid.adrangi@intel.com


   Mark Jones
   Bridgewater Systems Corporation
   303 Terry Fox Drive
   Ottawa, Ontario  K2K 3J1
   CANADA

   Email: mark.jones@bridgewatersystems.com


   Avi Lior
   Bridgewater Systems Corporation
   303 Terry Fox Drive
   Ottawa, Ontario  K2K 3J1
   CANADA

   Email: avi@bridgewatersystems.com














Tschofenig, et al.      Expires December 26, 2007              [Page 55]

Internet-Draft     Carrying LOs in RADIUS and Diameter         June 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Tschofenig, et al.      Expires December 26, 2007              [Page 56]


